# ClearOverrides Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerParameterManager..::..ClearOverrides Method
RebarContainerParameterManager Class See Also
---
Clears any overridden values from all parameters of the associated RebarContainer element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void ClearOverrides()
```

Visual Basic
---
```text
Public Sub ClearOverrides
```

Visual C++
---
```text
public:
void ClearOverrides()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace